{
	"format": "layers-model",
	"generatedBy": "keras v2.14.0",
	"convertedBy": "TensorFlow.js Converter v4.12.0",
	"modelTopology": {
		"keras_version": "2.14.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Sequential",
			"config": {
				"name": "sequential",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								100
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "embedding_input"
						}
					},
					{
						"class_name": "Embedding",
						"config": {
							"name": "embedding",
							"trainable": true,
							"dtype": "float32",
							"batch_input_shape": [
								null,
								100
							],
							"input_dim": 10000,
							"output_dim": 100,
							"embeddings_initializer": {
								"module": "keras.initializers",
								"class_name": "RandomUniform",
								"config": {
									"minval": -0.05,
									"maxval": 0.05,
									"seed": null
								},
								"registered_name": null
							},
							"embeddings_constraint": null,
							"mask_zero": false,
							"input_length": 100
						}
					},
					{
						"class_name": "LSTM",
						"config": {
							"name": "lstm",
							"trainable": true,
							"dtype": "float32",
							"return_sequences": false,
							"return_state": false,
							"go_backwards": false,
							"stateful": false,
							"unroll": false,
							"time_major": false,
							"units": 32,
							"activation": "tanh",
							"recurrent_activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								},
								"registered_name": null
							},
							"recurrent_initializer": {
								"module": "keras.initializers",
								"class_name": "Orthogonal",
								"config": {
									"gain": 1.0,
									"seed": null
								},
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"unit_forget_bias": true,
							"kernel_constraint": null,
							"recurrent_constraint": null,
							"bias_constraint": null,
							"dropout": 0.0,
							"recurrent_dropout": 0.0,
							"implementation": 2
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense",
							"trainable": true,
							"dtype": "float32",
							"units": 32,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								},
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_1",
							"trainable": true,
							"dtype": "float32",
							"units": 16,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								},
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_constraint": null,
							"bias_constraint": null
						}
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_2",
							"trainable": true,
							"dtype": "float32",
							"units": 1,
							"activation": "sigmoid",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								},
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_constraint": null,
							"bias_constraint": null
						}
					}
				]
			}
		},
		"training_config": {
			"loss": "binary_crossentropy",
			"metrics": [
				[
					{
						"class_name": "MeanMetricWrapper",
						"config": {
							"name": "accuracy",
							"dtype": "float32",
							"fn": "binary_accuracy"
						}
					}
				]
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Custom>Adam",
				"config": {
					"name": "Adam",
					"weight_decay": null,
					"clipnorm": null,
					"global_clipnorm": null,
					"clipvalue": null,
					"use_ema": false,
					"ema_momentum": 0.99,
					"ema_overwrite_frequency": null,
					"jit_compile": true,
					"is_legacy_optimizer": false,
					"learning_rate": 0.0010000000474974513,
					"beta_1": 0.9,
					"beta_2": 0.999,
					"epsilon": 1e-07,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": [
				"group1-shard1of1.bin"
			],
			"weights": [
				{
					"name": "dense/kernel",
					"shape": [
						32,
						32
					],
					"dtype": "float32"
				},
				{
					"name": "dense/bias",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/kernel",
					"shape": [
						32,
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/bias",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/kernel",
					"shape": [
						16,
						1
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/bias",
					"shape": [
						1
					],
					"dtype": "float32"
				},
				{
					"name": "embedding/embeddings",
					"shape": [
						10000,
						100
					],
					"dtype": "float32"
				},
				{
					"name": "lstm/lstm_cell/kernel",
					"shape": [
						100,
						128
					],
					"dtype": "float32"
				},
				{
					"name": "lstm/lstm_cell/recurrent_kernel",
					"shape": [
						32,
						128
					],
					"dtype": "float32"
				},
				{
					"name": "lstm/lstm_cell/bias",
					"shape": [
						128
					],
					"dtype": "float32"
				}
			]
		}
	]
}